
2. Refer the dataset "Advertising.csv" and perform following tasks.
i) Read the dataset "Advertising.csv" in data frame.
ii) Print first five records of dataset.
iii) print last five records from dataset.
iv) display the column names of the dataset.
v) display last three records from dataset.
vi) display the information about the dataset.
vii) display data types of each columns.
viii) check for null values in the dataset and display the sum of null values inside the column.
ix) drop all null values.
x) drop a column 'radio' from a dataset and display first ten records.
xi) increase the sales by 10% and add a new column "updated_sales" in dataframe.
xii) display shape of data.

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('./dataset/Advertising.csv')

In [3]:
data.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [4]:
data.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [6]:
data.columns.tolist()

['TV', 'radio', 'newspaper', 'sales']

In [9]:
data.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [10]:
print(data.dtypes)

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [11]:
print(data.isnull().sum())

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [13]:
data=data.dropna()

In [14]:
data2=data.drop('radio',axis=1)

In [12]:
data.head(10)

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8
7  120.2   19.6       11.6   13.2
8    8.6    2.1        1.0    4.8
9  199.8    2.6       21.2   10.6

In [13]:
data['updated_sales']=data['sales']* 1.10

In [14]:
data.shape

(200, 5)

In [15]:
data.head()

      TV  radio  newspaper  sales  updated_sales
0  230.1   37.8       69.2   22.1          24.31
1   44.5   39.3       45.1   10.4          11.44
2   17.2   45.9       69.3    9.3          10.23
3  151.5   41.3       58.5   18.5          20.35
4  180.8   10.8       58.4   12.9          14.19